OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1718.h
extern __at(0x0699) volatile __COG1RISbits_t COG1RISbits;

#define _G1RIS0                 0x01
#define _G1RIS1                 0x02
#define _G1RIS2                 0x04
#define _G1RIS3                 0x08
#define _G1RIS4                 0x10
#define _G1RIS5                 0x20
#define _G1RIS6                 0x40
#define _G1RIS7                 0x80

//==============================================================================


//==============================================================================
//        COG1RSIM Bits

extern __at(0x069A) __sfr COG1RSIM;

typedef struct
  {
  unsigned G1RSIM0              : 1;
  unsigned G1RSIM1              : 1;
  unsigned G1RSIM2              : 1;
  unsigned G1RSIM3              : 1;
  unsigned G1RSIM4              : 1;
  unsigned G1RSIM5              : 1;
  unsigned G1RSIM6              : 1;
  unsigned G1RSIM7              : 1;
  } __COG1RSIMbits_t;

extern __at(0x069A) volatile __COG1RSIMbits_t COG1RSIMbits;

#define _G1RSIM0                0x01
#define _G1RSIM1                0x02
#define _G1RSIM2                0x04
#define _G1RSIM3                0x08
#define _G1RSIM4                0x10
#define _G1RSIM5                0x20
#define _G1RSIM6                0x40
#define _G1RSIM7                0x80

//==============================================================================


//==============================================================================
//        COG1FIS Bits

extern __at(0x069B) __sfr COG1FIS;

typedef struct
  {
  unsigned G1FIS0               : 1;
  unsigned G1FIS1               : 1;
  unsigned G1FIS2               : 1;
  unsigned G1FIS3               : 1;
  unsigned G1FIS4               : 1;
  unsigned G1FIS5               : 1;
  unsigned G1FIS6               : 1;
  unsigned G1FIS7               : 1;
  } __COG1FISbits_t;

extern __at(0x069B) volatile __COG1FISbits_t COG1FISbits;

#define _G1FIS0                 0x01
#define _G1FIS1                 0x02
#define _G1FIS2                 0x04
#define _G1FIS3                 0x08
#define _G1FIS4                 0x10
#define _G1FIS5                 0x20
#define _G1FIS6                 0x40
#define _G1FIS7                 0x80

//==============================================================================


//==============================================================================
//        COG1FSIM Bits

extern __at(0x069C) __sfr COG1FSIM;

typedef struct
  {
  unsigned G1FSIM0              : 1;
  unsigned G1FSIM1              : 1;
  unsigned G1FSIM2              : 1;
  unsigned G1FSIM3              : 1;
  unsigned G1FSIM4              : 1;
  unsigned G1FSIM5              : 1;
  unsigned G1FSIM6              : 1;
  unsigned G1FSIM7              : 1;
  } __COG1FSIMbits_t;

extern __at(0x069C) volatile __COG1FSIMbits_t COG1FSIMbits;

#define _G1FSIM0                0x01
#define _G1FSIM1                0x02
#define _G1FSIM2                0x04
#define _G1FSIM3                0x08
#define _G1FSIM4                0x10
#define _G1FSIM5                0x20
#define _G1FSIM6                0x40
#define _G1FSIM7                0x80

//==============================================================================


//==============================================================================
//        COG1ASD0 Bits

extern __at(0x069D) __sfr COG1ASD0;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned G1ASDAC0           : 1;
    unsigned G1ASDAC1           : 1;
    unsigned G1ASDBD0           : 1;
    unsigned G1ASDBD1           : 1;
    unsigned G1ARSEN            : 1;
    unsigned G1ASE              : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned G1ASDAC            : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned G1ASDBD            : 2;
    unsigned                    : 2;
    };
  } __COG1ASD0bits_t;

extern __at(0x069D) volatile __COG1ASD0bits_t COG1ASD0bits;

#define _G1ASDAC0               0x04
#define _G1ASDAC1               0x08
#define _G1ASDBD0               0x10
#define _G1ASDBD1               0x20
#define _G1ARSEN                0x40
#define _G1ASE                  0x80

//==============================================================================


//==============================================================================
//        COG1ASD1 Bits

extern __at(0x069E) __sfr COG1ASD1;

typedef struct
  {
  unsigned G1AS0E               : 1;
  unsigned G1AS1E               : 1;
  unsigned G1AS2E               : 1;
  unsigned G1AS3E               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __COG1ASD1bits_t;

extern __at(0x069E) volatile __COG1ASD1bits_t COG1ASD1bits;

#define _G1AS0E                 0x01
#define _G1AS1E                 0x02
#define _G1AS2E                 0x04
#define _G1AS3E                 0x08

//==============================================================================


//==============================================================================
//        COG1STR Bits

extern __at(0x069F) __sfr COG1STR;

typedef struct
  {
  unsigned G1STRA               : 1;
  unsigned G1STRB               : 1;
  unsigned G1STRC               : 1;
  unsigned G1STRD               : 1;
  unsigned G1SDATA              : 1;
  unsigned G1SDATB              : 1;
  unsigned G1SDATC              : 1;
  unsigned G1SDATD              : 1;
  } __COG1STRbits_t;

extern __at(0x069F) volatile __COG1STRbits_t COG1STRbits;

#define _G1STRA                 0x01
#define _G1STRB                 0x02
#define _G1STRC                 0x04
#define _G1STRD                 0x08
#define _G1SDATA                0x10
#define _G1SDATB                0x20
#define _G1SDATC                0x40
#define _G1SDATD                0x80

//==============================================================================


//==============================================================================
//        PPSLOCK Bits

extern __at(0x0E0F) __sfr PPSLOCK;

typedef struct
  {
  unsigned PPSLOCKED            : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PPSLOCKbits_t;

extern __at(0x0E0F) volatile __PPSLOCKbits_t PPSLOCKbits;

#define _PPSLOCKED              0x01

//==============================================================================

